//Задати двомірний масив 𝑚∗𝑛 цілих чисел 𝑚=3,𝑛=3.Обчислити суму чисел по діагоналям(функція).
//Повернути елементи масиву на 90° за годинниковою стрілкою.
#include <iostream>
#include <stdio.h>
#include <conio.h>
#include <iomanip>
#include <cstdlib>
#include <ctime>
#include <time.h>

int A [3][3]; // матриця 1
int A1 [3][3]; /* матриця 2 */

using namespace std;
 
int main(void) // задали функцію

{
setlocale(LC_ALL,"Russian"); // код для нормального відображення тексту українською мовою (необов'язково)

int i, j,sum = 0; // змінні для подальшого використання

cout<<"Enter the matrix 3x3: \n"; // виводимо текст на екран для створення запиту для користувача

for(i=0; i<3; i++) // використовуємо цикли для створення двовимірної матриці
for(j=0; j<3; j++) 
cin>>A[i][j];  // завантажуємо елементи матриці в масив A

for(i=0; i<3; i++) 
 {
    for(j=0; j<3; j++) 
    cout<<A[i][j]<<" "; // виводимо матрицю після тексту на екран
    cout<<endl; 
 }

for(i=0; i<3; i++) 
for(j=0; j<3; j++) { if(i==j){sum += A[i][i]; }} // знаходимо суму елементів головної діагоналі

cout<<endl<<sum<<" "<< endl; // виводимо суму на екран

  for (i=0; i<3; i++)
  for (j=0; j<3; j++)
   A1[j][2-i]=A[i][j]; // повертаємо матрицю на 90 градусів вже в іншій матриці

 /* отриману матрицю виводимо на екран */
 printf("The resulting matrix:\n");
 for (i=0; i<3; i++, printf("\n"))
  for (j=0; j<3; printf("%3d  ", A1[i][j++]));

// таким чином отримуємо 2 матриці і суму головної діагоналі першої матриці

return 0;
}